# DUExcessiveRegeneration Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DocumentFailures..::..DUExcessiveRegeneration Property
BuiltInFailures..::..DocumentFailures Class See Also
---
Third party updater '[Name]' has caused an infinite loop and its action had to be canceled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DUExcessiveRegeneration { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DUExcessiveRegeneration As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DUExcessiveRegeneration {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DocumentFailures Class
Autodesk.Revit.DB Namespace